#
# Copyright (c) 2005, 2012, Oracle and/or its affiliates. All rights reserved.
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
#
# This code is free software; you can redistribute it and/or modify it
# under the terms of the GNU General Public License version 2 only, as
# published by the Free Software Foundation.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the LICENSE file that accompanied this code.
#
# This code is distributed in the hope that it will be useful, but WITHOUT
# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
# version 2 for more details (a copy is included in the LICENSE file that
# accompanied this code).
#
# You should have received a copy of the GNU General Public License version
# 2 along with this work; if not, write to the Free Software Foundation,
# Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
#
# Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA
# or visit www.oracle.com if you need additional information or have any
# questions.
#

no.sunjaxws.xml=\u5B9F\u884C\u6642\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF"{0}"\u304C\u3042\u308A\u307E\u305B\u3093

listener.parsingFailed=WSSERVLET11: \u5B9F\u884C\u6642\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF: {0}\u306E\u89E3\u6790\u306B\u5931\u6557\u3057\u307E\u3057\u305F
JAXRPCSERVLET11.diag.cause.1=WSRuntimeInfoParser\u306Fsun-jaxws.xml\u5B9F\u884C\u6642\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u3092\u89E3\u6790\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F
WSSERVLET11.diag.check.1=sun-jaxws.xml\u30D5\u30A1\u30A4\u30EB\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3001\u30D5\u30A1\u30A4\u30EB\u304C\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044
WSSERVLET11.diag.cause.2=sun-jaxws.xml\u5B9F\u884C\u6642\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30FB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u304C\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059
WSSERVLET11.diag.check.2=jaxrpc-ri.xml\u30D5\u30A1\u30A4\u30EB\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3001\u3053\u306E\u30D5\u30A1\u30A4\u30EB\u304CWAR\u30D5\u30A1\u30A4\u30EB\u306B\u5B58\u5728\u3059\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044


listener.info.initialize=WSSERVLET12: JAX-WS\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30EA\u30B9\u30CA\u30FC\u3092\u521D\u671F\u5316\u3057\u3066\u3044\u307E\u3059
WSSERVLET12.diag.cause.1=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30EA\u30B9\u30CA\u30FC\u3092\u8D77\u52D5\u3057\u3066\u3044\u307E\u3059
WSSERVLET12.diag.check.1=\u901A\u5E38\u306EWeb\u30B5\u30FC\u30D3\u30B9\u3092\u8D77\u52D5\u3057\u3066\u3044\u307E\u3059

listener.info.destroy=WSSERVLET13: JAX-WS\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30EA\u30B9\u30CA\u30FC\u3092\u7834\u68C4\u3057\u307E\u3057\u305F
WSSERVLET13.diag.cause.1=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30FB\u30EA\u30B9\u30CA\u30FC\u3092\u505C\u6B62\u3057\u307E\u3057\u305F
WSSERVLET13.diag.check.1=\u901A\u5E38\u306EWeb\u30B5\u30FC\u30D3\u30B9\u3092\u505C\u6B62\u3057\u307E\u3057\u305F

servlet.info.initialize=WSSERVLET14: JAX-WS\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3092\u521D\u671F\u5316\u3057\u3066\u3044\u307E\u3059
WSSERVLET14.diag.cause.1=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3092\u8D77\u52D5\u3057\u3066\u3044\u307E\u3059\u3002
WSSERVLET14.diag.check.1=\u901A\u5E38\u306EWeb\u30B5\u30FC\u30D3\u30B9\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u3059\u3002\u30B5\u30FC\u30D3\u30B9\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002

servlet.info.destroy=WSSERVLET15: JAX-WS\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3092\u7834\u68C4\u3057\u307E\u3057\u305F
WSSERVLET15.diag.cause.1=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u3092\u505C\u6B62\u3057\u307E\u3057\u305F\u3002
WSSERVLET15.diag.check.1=\u901A\u5E38\u306EWeb\u30B5\u30FC\u30D3\u30B9\u306E\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u3059\u3002\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002

servlet.warning.missingContextInformation=WSSERVLET16: \u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u60C5\u5831\u304C\u3042\u308A\u307E\u305B\u3093
WSSERVLET16.diag.cause.1=WAR\u30D5\u30A1\u30A4\u30EB\u306Bjaxrpc-ri.xml\u30D5\u30A1\u30A4\u30EB\u304C\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059
WSSERVLET16.diag.check.1=\u30B5\u30FC\u30D3\u30B9WAR\u30D5\u30A1\u30A4\u30EB\u3092\u89E3\u51CD\u3057\u3001jaxrpc-ri-runtime.xml\u30D5\u30A1\u30A4\u30EB\u304C\u5B58\u5728\u3059\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044


servlet.warning.duplicateEndpointName=WSSERVLET17: \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u540D\u304C\u91CD\u8907\u3057\u3066\u3044\u307E\u3059
WSSERVLET17.diag.cause.1=\u540C\u3058\u540D\u524D\u306E2\u3064\u4EE5\u4E0A\u306E\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u304Cjaxrpc-ri.xml\u5B9F\u884C\u6642\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u306B\u898B\u3064\u304B\u308A\u307E\u3057\u305F
WSSERVLET17.diag.check.1=\u3053\u308C\u306B\u3088\u308A\u30B5\u30FC\u30D3\u30B9\u30FB\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u554F\u984C\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059


servlet.info.emptyRequestMessage=WSSERVLET18: \u7A7A\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u53D6\u5F97\u3057\u307E\u3057\u305F
WSSERVLET18.diag.cause.1=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3088\u308A\u9001\u4FE1\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u7A7A\u3067\u3059
WSSERVLET18.diag.check.1=\u3053\u308C\u306F\u610F\u56F3\u7684\u306A\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002\u610F\u56F3\u7684\u3067\u306A\u3044\u5834\u5408\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30D7\u30ED\u30B0\u30E9\u30E0\u306B\u30A8\u30E9\u30FC\u304C\u306A\u3044\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002

servlet.trace.gotRequestForEndpoint=WSSERVLET19: \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8: {0}\u306B\u5BFE\u3059\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D6\u5F97\u3057\u307E\u3057\u305F
WSSERVLET19.diag.cause.1=\u3053\u306E\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306B\u5BFE\u3059\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u5230\u7740\u3057\u307E\u3057\u305F
WSSERVLET19.diag.check.1=\u5358\u306A\u308B\u60C5\u5831\u30E1\u30C3\u30BB\u30FC\u30B8\u3067\u3059\u3002\u901A\u5E38\u306E\u64CD\u4F5C\u3067\u3059\u3002

servlet.error.noImplementorForEndpoint=WSSERVLET20: \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8: {0}\u306E\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30BF\u304C\u5B58\u5728\u3057\u307E\u305B\u3093
WSSERVLET20.diag.cause.1=\u3053\u306E\u30B5\u30FC\u30D3\u30B9\u306E\u5B9F\u88C5\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093
WSSERVLET20.diag.check.1=WAR\u3092\u89E3\u51CD\u3057\u307E\u3059\u3002tie\u30AF\u30E9\u30B9\u304A\u3088\u3073\u30B7\u30EA\u30A2\u30E9\u30A4\u30B6\u30FB\u30AF\u30E9\u30B9\u306F\u898B\u3064\u304B\u308A\u307E\u3059\u304B\u3002

servlet.trace.invokingImplementor=WSSERVLET21: \u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30BF\u3092\u547C\u3073\u51FA\u3057\u3066\u3044\u307E\u3059: {0}
WSSERVLET21.diag.cause.1=Web\u30B5\u30FC\u30D3\u30B9\u3092\u547C\u3073\u51FA\u3057\u3066\u3044\u307E\u3059
WSSERVLET21.diag.check.1=\u901A\u5E38\u306EWeb\u30B5\u30FC\u30D3\u30B9\u306E\u547C\u51FA\u3057\u3067\u3059\u3002

servlet.error.noEndpointSpecified=WSSERVLET22: \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093
WSSERVLET22.diag.cause.1=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306A\u3057\u3067\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u547C\u3073\u51FA\u3055\u308C\u307E\u3057\u305F
WSSERVLET22.diag.check.1=stub.setTargetEndpoint\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u3088\u308A\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044

servlet.error.noResponseMessage=WSSERVLET23: \u30EC\u30B9\u30DD\u30F3\u30B9\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u3042\u308A\u307E\u305B\u3093
WSSERVLET23.diag.cause.1=\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u3088\u308A\u30B5\u30FC\u30D3\u30B9\u304B\u3089\u30EC\u30B9\u30DD\u30F3\u30B9\u304C\u751F\u6210\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F
WSSERVLET23.diag.check.1=\u30EC\u30B9\u30DD\u30F3\u30B9\u304C\u4E88\u671F\u3055\u308C\u305F\u5834\u5408\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u5B9F\u969B\u306B\u9001\u4FE1\u3055\u308C\u305F\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044
WSSERVLET23.diag.check.2=\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u6B63\u3057\u304F\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u30B5\u30FC\u30D3\u30B9\u306B\u3088\u308A\u53D7\u5165\u308C\u53EF\u80FD\u3067\u3059\u304C\u3001\u30EC\u30B9\u30DD\u30F3\u30B9\u306F\u751F\u6210\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F

servlet.trace.writingFaultResponse=WSSERVLET24: \u30D5\u30A9\u30EB\u30C8\u30FB\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u66F8\u304D\u8FBC\u3093\u3067\u3044\u307E\u3059
WSSERVLET24.diag.cause.1=SOAPFault\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u8FD4\u3057\u3066\u3044\u307E\u3059\u3002
WSSERVLET24.diag.check.1=\u30C8\u30EC\u30FC\u30B9\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u30FB\u30D5\u30A9\u30EB\u30C8\u304C\u8A18\u9332\u3055\u308C\u307E\u3057\u305F\u3002

servlet.trace.writingSuccessResponse=WSSERVLET25: \u6B63\u5E38\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u66F8\u304D\u8FBC\u3093\u3067\u3044\u307E\u3059
WSSERVLET25.diag.cause.1=SOAPMessage\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u8FD4\u3057\u3066\u3044\u307E\u3059
WSSERVLET25.diag.check.1=\u30C8\u30EC\u30FC\u30B9\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u3001\u901A\u5E38\u306E\u30EC\u30B9\u30DD\u30F3\u30B9\u3002

servlet.warning.duplicateEndpointUrlPattern=WSSERVLET26: \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306B\u91CD\u8907\u3057\u305FURL\u30D1\u30BF\u30FC\u30F3\u304C\u3042\u308A\u307E\u3059: {0}
WSSERVLET26.diag.cause.1=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8URL\u304C\u91CD\u8907\u3057\u3066\u3044\u307E\u3059
WSSERVLET26.diag.check.1=\u3053\u308C\u306B\u3088\u308A\u554F\u984C\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u91CD\u8907\u3057\u305F\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044

servlet.warning.ignoringImplicitUrlPattern=WSSERVLET27: \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8: {0}\u3067\u306F\u6697\u9ED9\u7684\u306AURL\u30D1\u30BF\u30FC\u30F3\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093
WSSERVLET27.diag.cause.1=\u3053\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u306F\u6697\u9ED9\u7684\u306AURL\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093
WSSERVLET27.diag.check.1=\u6697\u9ED9\u7684\u306AURL\u3092\u524A\u9664\u3057\u307E\u3059

servlet.faultstring.missingPort=WSSERVLET28: \u30DD\u30FC\u30C8\u60C5\u5831\u304C\u3042\u308A\u307E\u305B\u3093
WSSERVLET28.diag.cause.1=\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u304Cnull\u3067\u3059
WSSERVLET28.diag.check.1=stub.setTargetEndpoint()\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u3088\u308A\u30BF\u30FC\u30B2\u30C3\u30C8\u30FB\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002

servlet.faultstring.portNotFound=WSSERVLET29: \u30DD\u30FC\u30C8\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093({0})
WSSERVLET29.diag.cause.1=\u30DD\u30FC\u30C8\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u304C\u3001\u5BFE\u5FDC\u3059\u308B\u30B5\u30FC\u30D3\u30B9\u5B9F\u88C5\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093
WSSERVLET29.diag.check.1=\u30DD\u30FC\u30C8\u306F\u6709\u52B9\u3067\u3059\u304B\u3002WAR\u30D5\u30A1\u30A4\u30EB\u3092\u89E3\u51CD\u3057\u3001tie\u304A\u3088\u3073\u30B7\u30EA\u30A2\u30E9\u30A4\u30B6\u304C\u5B58\u5728\u3059\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044

servlet.faultstring.internalServerError=WSSERVLET30: \u5185\u90E8\u30B5\u30FC\u30D0\u30FC\u30FB\u30A8\u30E9\u30FC({0})
WSSERVLET30.diag.cause.1=\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u51E6\u7406\u4E2D\u306B\u30B5\u30FC\u30D0\u30FC\u30FB\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F
WSSERVLET30.diag.check.1=\u3053\u308C\u306B\u306F\u591A\u304F\u306E\u539F\u56E0\u304C\u8003\u3048\u3089\u308C\u307E\u3059\u3002\u30B5\u30FC\u30D0\u30FC\u30FB\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3067\u4F8B\u5916\u306E\u6709\u7121\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002

error.servlet.caughtThrowableWhileRecovering=WSSERVLET51: \u524D\u306E\u4F8B\u5916\u304B\u3089\u306E\u56DE\u5FA9\u4E2D\u306Bthrowable\u3092\u6355\u6349\u3057\u307E\u3057\u305F: {0}
WSSERVLET51.diag.cause.1=\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u30B5\u30FC\u30D3\u30B9\u51E6\u7406\u3067\u4F8B\u5916\u304C\u751F\u6210\u3055\u308C\u307E\u3057\u305F\u3002SOAPPFaultMessage\u3092\u8FD4\u3059\u51E6\u7406\u306E\u8A66\u884C\u4E2D\u306Bthrowable\u304C\u518D\u5EA6\u751F\u6210\u3055\u308C\u307E\u3057\u305F
WSSERVLET51.diag.check.1=server.xml\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3067\u4F8B\u5916\u60C5\u5831\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044

error.servlet.caughtThrowable=WSSERVLET49: throwable\u3092\u6355\u6349\u3057\u307E\u3057\u305F: {0}
WSSERVLET49.diag.cause.1=\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u30B5\u30FC\u30D3\u30B9\u51E6\u7406\u3067\u4F8B\u5916\u304C\u751F\u6210\u3055\u308C\u307E\u3057\u305F\u3002SOAPFaultMessage\u3092\u8FD4\u3059\u51E6\u7406\u306E\u8A66\u884C\u4E2D\u306Bthrowable\u304C\u518D\u5EA6\u751F\u6210\u3055\u308C\u307E\u3057\u305F
WSSERVLET49.diag.check.1=server.xml\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3067\u4F8B\u5916\u60C5\u5831\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044

error.servlet.caughtThrowableInInit=WSSERVLET50: \u30B5\u30FC\u30D6\u30EC\u30C3\u30C8\u306E\u521D\u671F\u5316\u4E2D\u306Bthrowable\u3092\u6355\u6349\u3057\u307E\u3057\u305F: {0}
WSSERVLET50.diag.cause.1=WS\u30E9\u30F3\u30BF\u30A4\u30E0sun-jaxws.xml\u307E\u305F\u306Fweb.xml\u304C\u6B63\u3057\u304F\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059
WSSERVLET50.diag.check.1=\u30B5\u30FC\u30D3\u30B9WAR\u30D5\u30A1\u30A4\u30EB\u3067sun-jaxws.xml\u304A\u3088\u3073web.xml\u304C\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044
WSSERVLET50.diag.cause.2=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30FB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u304C\u6B63\u3057\u304F\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059
WSSERVLET50.diag.check.2=\u30B5\u30FC\u30D3\u30B9WAR\u30D5\u30A1\u30A4\u30EB\u3067\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30FB\u30C7\u30A3\u30B9\u30AF\u30EA\u30D7\u30BF\u304C\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044
WSSERVLET50.diag.cause.3=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B5\u30FC\u30D0\u30FC\u306E\u521D\u671F\u5316\u306E\u554F\u984C\u304C\u767A\u751F\u3057\u305F\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059
WSSERVLET50.diag.check.3=\u30C9\u30E1\u30A4\u30F3\u30FB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306Eserver.xml\u30D5\u30A1\u30A4\u30EB\u306B\u554F\u984C\u304C\u306A\u3044\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044

publisher.info.applyingTransformation=WSSERVLET31: \u5B9F\u969B\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u5909\u63DB\u3092\u9069\u7528\u3057\u3066\u3044\u307E\u3059: {0}
WSSERVLET31.diag.cause.1=\u5909\u63DB\u3092\u9069\u7528\u3057\u3066\u3044\u307E\u3059
WSSERVLET31.diag.check.1=\u901A\u5E38\u306E\u64CD\u4F5C

publisher.info.generatingWSDL=WSSERVLET32: \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8: {0}\u306B\u3064\u3044\u3066WSDL\u3092\u751F\u6210\u3057\u3066\u3044\u307E\u3059
WSSERVLET32.diag.cause.1=WSDL\u3092\u751F\u6210\u3057\u3066\u3044\u307E\u3059
WSSERVLET32.diag.check.1=\u901A\u5E38\u306E\u64CD\u4F5C\u3067\u3059\u3002

exception.cannotCreateTransformer=WSSERVLET33: \u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093
WSSERVLET33.diag.cause.1=\u30B5\u30FC\u30D3\u30B9WSDL\u3092\u30D1\u30D6\u30EA\u30C3\u30B7\u30E5\u3059\u308B\u969B\u306B\u3001XSLT\u5909\u63DB\u3092\u4F7F\u7528\u3057\u3066HTTP\u306E\u5834\u6240\u306B\u30C7\u30D7\u30ED\u30A4\u6E08\u306E\u5834\u6240/\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u304C\u30D1\u30C3\u30C1\u3055\u308C\u307E\u3059\u3002\u5909\u63DB\u3092\u884C\u3046\u305F\u3081\u306E\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
WSSERVLET33.diag.check.1=\u4E92\u63DB\u6027\u306E\u306A\u3044\u5909\u63DB\u30A8\u30F3\u30B8\u30F3\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u6B63\u3057\u3044\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u304A\u3088\u3073\u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
WSSERVLET33.diag.cause.2=\u30B5\u30FC\u30D3\u30B9WSDL\u3092\u30D1\u30D6\u30EA\u30C3\u30B7\u30E5\u3059\u308B\u969B\u306B\u3001XSLT\u5909\u63DB\u3092\u4F7F\u7528\u3057\u3066HTTP\u306E\u5834\u6240\u306B\u30C7\u30D7\u30ED\u30A4\u6E08\u306E\u5834\u6240/\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u304C\u30D1\u30C3\u30C1\u3055\u308C\u307E\u3059\u3002\u5909\u63DB\u3092\u884C\u3046\u305F\u3081\u306E\u30C8\u30E9\u30F3\u30B9\u30D5\u30A9\u30FC\u30DE\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
WSSERVLET33.diag.check.2=\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u304B\u4E92\u63DB\u6027\u306E\u306A\u3044\u5909\u63DB\u30A8\u30F3\u30B8\u30F3\u304C\u5B58\u5728\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002server.xml\u30D5\u30A1\u30A4\u30EB\u3067\u4F8B\u5916\u306E\u6709\u7121\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002


exception.transformationFailed=WSSERVLET34: \u5909\u63DB\u306B\u5931\u6557\u3057\u307E\u3057\u305F: {0}
WSSERVLET34.diag.cause.1=\u5909\u63DB\u306E\u8A66\u884C\u4E2D\u306B\u3001WSDL\u3067\u306E\u5834\u6240\u306E\u30D1\u30C3\u30C1\u9069\u7528\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
WSSERVLET34.diag.check.1=\u30A8\u30E9\u30FC/\u4F8B\u5916\u306E\u8A73\u7D30\u306F\u3001\u30ED\u30B0\u30FB\u30D5\u30A1\u30A4\u30EB\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002

exception.templateCreationFailed=WSSERVLET35: \u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F
WSSERVLET35.diag.cause.1=\u5909\u63DB\u3092\u4F7F\u7528\u3057\u305FWSDL\u306E\u5834\u6240\u306E\u30D1\u30C3\u30C1\u9069\u7528\u3067\u306F\u3001XSLT\u30B9\u30BF\u30A4\u30EB\u30B7\u30FC\u30C8\u30FB\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
WSSERVLET35.diag.check.1=\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u306E\u4F5C\u6210\u4E2D\u306B\u4F8B\u5916\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F\u3002\u8A73\u7D30\u306F\u3001\u4F8B\u5916\u304A\u3088\u3073\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002

servlet.html.method=WSSERVLET63: \u3053\u306E\u30BF\u30A4\u30D7\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u306FPOST\u3092\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059
WSSERVLET63.diag.cause.1=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u3067\u306FHTTP POST\u30E1\u30BD\u30C3\u30C9\u3092\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: WSI BP 1.0
WSSERVLET63.diag.check.1=HTTP\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C(GET\u30EA\u30AF\u30A8\u30B9\u30C8\u3067\u306F\u306A\u304F)POST\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044


servlet.faultstring.invalidContentType=WSSERVLET64: \u7121\u52B9\u306AContent-Type\u3067\u3059\u3002text/xml\u304C\u5FC5\u8981\u3067\u3059
WSSERVLET64.diag.cause.1=Web\u30B5\u30FC\u30D3\u30B9\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u30FB\u30BF\u30A4\u30D7\u306Ftext/xml\u3067\u3042\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: WSI BP 1.0
WSSERVLET64.diag.check.1=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u3067text/xml\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044

error.implementorFactory.newInstanceFailed=WSSERVLET43: \u30DD\u30FC\u30C8\"{0}\"\u306E\u30B5\u30FC\u30D3\u30B9\u30FB\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30BF\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u306B\u5931\u6557\u3057\u307E\u3057\u305F
WSSERVLET43.diag.cause.1=Web\u30B5\u30FC\u30D3\u30B9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
WSSERVLET43.diag.check.1=Web\u30B5\u30FC\u30D3\u30B9\u304C\u4F7F\u7528\u53EF\u80FD\u304B\u3064\u30D1\u30D6\u30EA\u30C3\u30AF\u3067\u3042\u308B\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u8A73\u7D30\u306F\u4F8B\u5916\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044

error.implementorFactory.servantInitFailed=WSSERVLET44: \u30DD\u30FC\u30C8\"{0}\"\u306E\u30B5\u30FC\u30D3\u30B9\u30FB\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30BF\u306E\u521D\u671F\u5316\u306B\u5931\u6557\u3057\u307E\u3057\u305F
WSSERVLET44.diag.cause.1=Web\u30B5\u30FC\u30D3\u30B9\u306F\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u521D\u671F\u5316\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F
WSSERVLET44.diag.check.1=\u8A73\u7D30\u306F\u4F8B\u5916\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u69CB\u6210\u30D5\u30A1\u30A4\u30EB\u304C\u3059\u3079\u3066\u6B63\u3057\u3044\u3053\u3068\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002

#not used by anything currently
servlet.faultstring.invalidSOAPAction=WSSERVLET65: \u5FC5\u9808\u306E\u30D8\u30C3\u30C0\u30FCSOAPAction\u304C\u7121\u52B9\u3067\u3059
WSSERVLET65.diag.cause.1=SOAP\u30A2\u30AF\u30B7\u30E7\u30F3\u306F\u5FC5\u9808\u3067\u3059
WSSERVLET65.diag.check.1=SOAPAction\u304A\u3088\u3073\u9069\u5207\u306A\u5024\u3092\u8FFD\u52A0\u3057\u3066\u304F\u3060\u3055\u3044

# {0} - URI
servlet.no.address.available={0}\u306B\u4F7F\u7528\u3067\u304D\u308B\u30A2\u30C9\u30EC\u30B9\u304C\u3042\u308A\u307E\u305B\u3093

servlet.html.title= Web\u30B5\u30FC\u30D3\u30B9
servlet.html.title2=<h1>Web\u30B5\u30FC\u30D3\u30B9</h1>
servlet.html.noInfoAvailable=<p>JAX-WS\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u60C5\u5831\u3092\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002</p>
servlet.html.columnHeader.portName=\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8
servlet.html.columnHeader.status=\u30B9\u30C6\u30FC\u30BF\u30B9
servlet.html.columnHeader.information=\u60C5\u5831
# This is a status code and should not be translated (if you have to, translate it using capital letters).
servlet.html.status.active=ACTIVE
# This is a status code and should not be translated (if you have to, translate it using capital letters).
servlet.html.status.error=ERROR
servlet.html.endpoint.table=<table border=\"0\"><tr><td>\u30B5\u30FC\u30D3\u30B9\u540D\:</td><td>{0}</td></tr><tr><td>\u30DD\u30FC\u30C8\u540D\:</td><td>{1}</td></tr></table>
servlet.html.information.table=<table border=\"0\"><tr><td>\u30A2\u30C9\u30EC\u30B9\:</td><td>{0}</td></tr><tr><td>WSDL\:</td><td><a href\="{0}?wsdl">{0}?wsdl</a></td></tr><tr><td>\u5B9F\u88C5\u30AF\u30E9\u30B9\:</td><td>{1}</td></tr></table>
servlet.html.notFound=<h1>404\u898B\u3064\u304B\u308A\u307E\u305B\u3093: {0}</h1>


#
#
# all the following properties are used by the http/ea package
# these properties are not longer used as http/ea is no longer used
#
error.implementorFactory.noConfiguration=WSSERVLET36: \u69CB\u6210\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093
error.implementorFactory.noInputStream=WSSERVLET37: \u69CB\u6210\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093
error.implementorRegistry.unknownName=WSSERVLET38: \u4E0D\u660E\u306A\u30DD\u30FC\u30C8\u540D: {0}
error.implementorRegistry.cannotReadConfiguration=WSSERVLET39: \u69CB\u6210\u3092\u8AAD\u307F\u53D6\u308C\u307E\u305B\u3093
error.implementorRegistry.classNotFound=WSSERVLET40: \u30AF\u30E9\u30B9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093: {0}
error.implementorRegistry.incompleteInformation=WSSERVLET41: \u69CB\u6210\u60C5\u5831\u304C\u4E0D\u5341\u5206\u3067\u3059
error.implementorRegistry.duplicateName=WSSERVLET42: \u91CD\u8907\u3057\u305F\u30DD\u30FC\u30C8\u540D: {0}

error.implementorRegistry.fileNotFound=WSSERVLET45: \u30D5\u30A1\u30A4\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093: {0}
error.wsdlPublisher.cannotReadConfiguration=WSSERVLET46: \u69CB\u6210\u3092\u8AAD\u307F\u53D6\u308C\u307E\u305B\u3093
error.servlet.init.config.parameter.missing=WSSERVLET47: \u69CB\u6210\u30D1\u30E9\u30E1\u30FC\u30BF\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093: \"{0}\"
error.servlet.init.config.fileNotFound=WSSERVLET48: \u69CB\u6210\u30D5\u30A1\u30A4\u30EB: \"{0}\"\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093
#

error.servlet.noImplementorForPort=WSSERVLET52: \u30DD\u30FC\u30C8: {0}\u306B\u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30BF\u304C\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093
error.servlet.noPortSpecified=WSSERVLET53: HTTP POST\u30EA\u30AF\u30A8\u30B9\u30C8URL\u306B\u30DD\u30FC\u30C8\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093
error.servlet.noResponseWasProduced=WSSERVLET54: \u30EC\u30B9\u30DD\u30F3\u30B9\u304C\u751F\u6210\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F(\u5185\u90E8\u30A8\u30E9\u30FC)
#
info.servlet.gotEmptyRequestMessage=WSSERVLET55: \u7A7A\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u30FB\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u53D6\u5F97\u3057\u307E\u3057\u305F
info.servlet.initializing=WSSERVLET56: JAX-WS\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8: \u521D\u671F\u5316
info.servlet.destroying=WSSERVLET57: JAX-WS\u30B5\u30FC\u30D6\u30EC\u30C3\u30C8: \u7834\u68C4
#
trace.servlet.requestForPortNamed=WSSERVLET58: \u30DD\u30FC\u30C8: {0}\u306B\u5BFE\u3059\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D6\u5F97\u3057\u307E\u3057\u305F
trace.servlet.handingRequestOverToImplementor=WSSERVLET59: \u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30BF: {0}\u306B\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u6E21\u3057\u3066\u3044\u307E\u3059
trace.servlet.gotResponseFromImplementor=WSSERVLET60: \u30A4\u30F3\u30D7\u30EA\u30E1\u30F3\u30BF: {0}\u304B\u3089\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u53D6\u5F97\u3057\u307E\u3057\u305F
trace.servlet.writingFaultResponse=WSSERVLET61: \u30D5\u30A9\u30EB\u30C8\u30FB\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u66F8\u304D\u8FBC\u3093\u3067\u3044\u307E\u3059
trace.servlet.writingSuccessResponse=WSSERVLET62: \u6B63\u5E38\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u66F8\u304D\u8FBC\u3093\u3067\u3044\u307E\u3059
#
html.nonRootPage.title= Web\u30B5\u30FC\u30D3\u30B9
html.nonRootPage.body1= <p>Web\u30B5\u30FC\u30D3\u30B9\u306F\u3053\u306EURL\u3067\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u307E\u3059\u3002</p>
html.nonRootPage.body2= <p>\u7121\u52B9\u306A\u30EA\u30AF\u30A8\u30B9\u30C8URI\u3067\u3059\u3002</p><p>\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u60C5\u5831\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002</p>
# Usage not found. TODO Remove
#html.nonRootPage.body3a= <p>Please refer to <a href=\'
# Concatenated with html.nonRootPage.body3a
#html.nonRootPage.body3b= \'>this page</a> for information about the deployed services.</p>
html.wsdlPage.title= Web\u30B5\u30FC\u30D3\u30B9
html.wsdlPage.noWsdl=<p>\u30D1\u30D6\u30EA\u30C3\u30B7\u30E5\u306B\u4F7F\u7528\u3067\u304D\u308BWSDL\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u304C\u3042\u308A\u307E\u305B\u3093\u3002</p><p>\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u60C5\u5831\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002</p>
html.rootPage.title= Web\u30B5\u30FC\u30D3\u30B9
html.rootPage.body1=<p>Web\u30B5\u30FC\u30D3\u30B9\u306F\u3053\u306EURL\u3067\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u307E\u3059\u3002</p>
html.rootPage.body2a=<p>\u6B21\u306E\u30DD\u30FC\u30C8\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u3059:
html.rootPage.body2b=</p>
# Usage not found. TODO Remove
#html.rootPage.body3a=<p>A WSDL description of these ports is available <a href='
# Concatenated with html.rootPage.body3a
#html.rootPage.body3b='>here.</a></p>
html.rootPage.body4=<p>\u3053\u306E\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306F\u6B63\u3057\u304F\u69CB\u6210\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u69CB\u6210\u30D5\u30A1\u30A4\u30EB\u306E\u5834\u6240\u304A\u3088\u3073\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002</p>
