#
# Copyright (c) 2005, 2012, Oracle and/or its affiliates. All rights reserved.
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
#
# This code is free software; you can redistribute it and/or modify it
# under the terms of the GNU General Public License version 2 only, as
# published by the Free Software Foundation.  Oracle designates this
# particular file as subject to the "Classpath" exception as provided
# by Oracle in the LICENSE file that accompanied this code.
#
# This code is distributed in the hope that it will be useful, but WITHOUT
# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
# version 2 for more details (a copy is included in the LICENSE file that
# accompanied this code).
#
# You should have received a copy of the GNU General Public License version
# 2 along with this work; if not, write to the Free Software Foundation,
# Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
#
# Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA
# or visit www.oracle.com if you need additional information or have any
# questions.
#

no.sunjaxws.xml=Falta el descriptor en tiempo de ejecuci\u00F3n"{0}"

listener.parsingFailed=WSSERVLET11: Fallo al analizar el descriptor en tiempo de ejecuci\u00F3n: {0}
JAXRPCSERVLET11.diag.cause.1=WSRuntimeInfoParser no ha podido analizar el descriptor en tiempo de ejecuci\u00F3n sun-jaxws.xml
WSSERVLET11.diag.check.1=Compruebe el archivo sun-jaxws.xml para asegurarse de que es correcto
WSSERVLET11.diag.cause.2=Puede que falte el descriptor de despliegue en tiempo de ejecuci\u00F3n sun-jaxws.xml
WSSERVLET11.diag.check.2=Compruebe el archivo jaxrpc-ri.xml para asegurarse de que se encuentra en el archivo war


listener.info.initialize=WSSERVLET12: inicializando el listener de contexto de JAX-WS
WSSERVLET12.diag.cause.1=Iniciando listener de contexto
WSSERVLET12.diag.check.1=Inicio de servicio web normal

listener.info.destroy=WSSERVLET13: el listener de contexto de JAX-WS se ha destruido
WSSERVLET13.diag.cause.1=Cierre de listener de contexto
WSSERVLET13.diag.check.1=Cierre de servicio web normal

servlet.info.initialize=WSSERVLET14: inicializando el servlet de JAX-WS
WSSERVLET14.diag.cause.1=Iniciando el servlet de servicios web.
WSSERVLET14.diag.check.1=Despliegue de servicio web normal. Se ha completado el despliegue del servicio.

servlet.info.destroy=WSSERVLET15: el servlet de JAX-WS se ha destruido
WSSERVLET15.diag.cause.1=El servlet de servicios web se ha cerrado.
WSSERVLET15.diag.check.1=Anulaci\u00F3n de despliegue normal del servicio web. Se ha completado la anulaci\u00F3n del despliegue.

servlet.warning.missingContextInformation=WSSERVLET16: falta informaci\u00F3n de contexto
WSSERVLET16.diag.cause.1=Puede que falte el archivo jaxrpc-ri.xml en el archivo war
WSSERVLET16.diag.check.1=Extraiga el archivo jar del archivo war del servicio para comprobar si est\u00E1 el archivo jaxrpc-ri-runtime.xml


servlet.warning.duplicateEndpointName=WSSERVLET17: nombre de punto final duplicado
WSSERVLET17.diag.cause.1=Se han encontrado dos o m\u00E1s puntos finales con el mismo nombre en el descriptor de tiempo de ejecuci\u00F3n jaxrpc-ri.xml
WSSERVLET17.diag.check.1=Tenga en cuenta que esto podr\u00EDa producir problemas con el despliegue del servicio


servlet.info.emptyRequestMessage=WSSERVLET18: se ha obtenido un mensaje de solicitud vac\u00EDo
WSSERVLET18.diag.cause.1=El mensaje que ha enviado el cliente est\u00E1 vac\u00EDo
WSSERVLET18.diag.check.1=Podr\u00EDa ser o no intencionado. En caso de que no lo sea, examine el programa del cliente para buscar errores.

servlet.trace.gotRequestForEndpoint=WSSERVLET19: Se ha obtenido la solicitud para el punto final: {0}
WSSERVLET19.diag.cause.1=Ha llegado la solicitud del cliente para este punto final
WSSERVLET19.diag.check.1=S\u00F3lo mensaje informativo. Funcionamiento normal.

servlet.error.noImplementorForEndpoint=WSSERVLET20: No hay ning\u00FAn implantador para el punto final: {0}
WSSERVLET20.diag.cause.1=No se ha encontrado la implantaci\u00F3n de este servicio
WSSERVLET20.diag.check.1=Descomprima el archivo war. \u00BFEncuentra las clases del serializador y de uni\u00F3n?

servlet.trace.invokingImplementor=WSSERVLET21: Llamando al implantador: {0}
WSSERVLET21.diag.cause.1=Se est\u00E1 llamando al servicio web
WSSERVLET21.diag.check.1=Llamada normal al servicio web.

servlet.error.noEndpointSpecified=WSSERVLET22: no se ha especificado un punto final
WSSERVLET22.diag.cause.1=Se ha llamado a una solicitud sin ning\u00FAn punto final
WSSERVLET22.diag.check.1=Defina el punto final con la propiedad stub.setTargetEndpoint

servlet.error.noResponseMessage=WSSERVLET23: no hay ning\u00FAn mensaje de respuesta
WSSERVLET23.diag.cause.1=La solicitud no ha generado ninguna respuesta del servicio
WSSERVLET23.diag.check.1=Si se esperaba una respuesta, compruebe si realmente se ha enviado un mensaje de solicitud
WSSERVLET23.diag.check.2=Puede que la solicitud tenga un formato incorrecto y que la haya aceptado el servicio, pero no se haya generado una respuesta

servlet.trace.writingFaultResponse=WSSERVLET24: escribiendo respuesta a fallo
WSSERVLET24.diag.cause.1=Se est\u00E1 devolviendo al cliente el mensaje SOAPFault.
WSSERVLET24.diag.check.1=Se ha registrado el fallo del mensaje de rastreo.

servlet.trace.writingSuccessResponse=WSSERVLET25: escribiendo respuesta correcta
WSSERVLET25.diag.cause.1=Se est\u00E1 devolviendo la respuesta SOAPMessage al cliente
WSSERVLET25.diag.check.1=Rastreando mensaje; respuesta normal.

servlet.warning.duplicateEndpointUrlPattern=WSSERVLET26: Patr\u00F3n de URL duplicado en punto final: {0}
WSSERVLET26.diag.cause.1=La URL de punto final es un duplicado
WSSERVLET26.diag.check.1=Podr\u00EDa producir un problema. Elimine los puntos finales duplicados

servlet.warning.ignoringImplicitUrlPattern=WSSERVLET27: Patr\u00F3n de URL impl\u00EDcitas no soportado en el punto final: {0}
WSSERVLET27.diag.cause.1=Las URL impl\u00EDcitas no est\u00E1n soportadas en esta versi\u00F3n
WSSERVLET27.diag.check.1=Elimine la URL impl\u00EDcita

servlet.faultstring.missingPort=WSSERVLET28: falta la informaci\u00F3n de puerto
WSSERVLET28.diag.cause.1=El punto final de destino es nulo
WSSERVLET28.diag.check.1=Defina el punto final de destino con la propiedad stub.setTargetEndpoint().

servlet.faultstring.portNotFound=WSSERVLET29: no se ha encontrado el puerto ({0})
WSSERVLET29.diag.cause.1=Se ha especificado un puerto, pero no se ha encontrado una implantaci\u00F3n del servicio correspondiente
WSSERVLET29.diag.check.1=\u00BFEl puerto es v\u00E1lido? Descomprima el archivo war y aseg\u00FArese de que la uni\u00F3n y los serializadores se encuentran en \u00E9l

servlet.faultstring.internalServerError=WSSERVLET30: error de servidor interno ({0})
WSSERVLET30.diag.cause.1=Se ha producido un error del servidor al procesar la solicitud
WSSERVLET30.diag.check.1=Se puede deber a varias causas. Compruebe si hay excepciones en el archivo log del servidor.

error.servlet.caughtThrowableWhileRecovering=WSSERVLET51: Devoluci\u00F3n resuelta al recuperarse de una excepci\u00F3n anterior: {0}
WSSERVLET51.diag.cause.1=El procesamiento del servicio de la solicitud ha generado una excepci\u00F3n. Al intentar devolver un SOAPPFaultMessage, se ha generado de nuevo una devoluci\u00F3n
WSSERVLET51.diag.check.1=Compruebe en el archivo log server.xml la informaci\u00F3n de la excepci\u00F3n

error.servlet.caughtThrowable=WSSERVLET49: Devoluci\u00F3n resuelta: {0}
WSSERVLET49.diag.cause.1=El procesamiento del servicio de la solicitud ha generado una excepci\u00F3n. Al intentar devolver un SOAPFaultMessage, se ha generado de nuevo una devoluci\u00F3n
WSSERVLET49.diag.check.1=Compruebe en el archivo log server.xml la informaci\u00F3n de la excepci\u00F3n

error.servlet.caughtThrowableInInit=WSSERVLET50: Devoluci\u00F3n resuelta durante la inicializaci\u00F3n del servlet: {0}
WSSERVLET50.diag.cause.1=Puede que sun-jaxws.xml o web.xml en tiempo de ejecuci\u00F3n de WS sean incorrectos
WSSERVLET50.diag.check.1=Verifique que sun-jaxws.xml y web.xml son correctos en el archivo war del servicio
WSSERVLET50.diag.cause.2=Puede que los descriptores de despliegue del servidor de aplicaciones sean incorrectos
WSSERVLET50.diag.check.2=Verifique que los descriptores de despliegue del servidor de aplicaciones sean correctos en el archivo war del servicio
WSSERVLET50.diag.cause.3=Puede que haya algunos problemas de inicializaci\u00F3n del servidor de aplicaciones
WSSERVLET50.diag.check.3=Compruebe el archivo server.xml en el directorio del dominio para ver si hay fallos

publisher.info.applyingTransformation=WSSERVLET31: Aplicando la transformaci\u00F3n con la direcci\u00F3n real: {0}
WSSERVLET31.diag.cause.1=Se est\u00E1 aplicando la transformaci\u00F3n
WSSERVLET31.diag.check.1=Funcionamiento normal

publisher.info.generatingWSDL=WSSERVLET32: Generando WSDL para punto final: {0}
WSSERVLET32.diag.cause.1=Se est\u00E1 generando el WSDL
WSSERVLET32.diag.check.1=Funcionamiento normal.

exception.cannotCreateTransformer=WSSERVLET33: no se puede crear el transformador
WSSERVLET33.diag.cause.1=Cuando se publica el WSDL de servicio, se aplica un parche a la ubicaci\u00F3n http con la ubicaci\u00F3n/punto final desplegados utilizando la transformaci\u00F3n XSLT. No se ha podido crear el transformador para realizar la transformaci\u00F3n.
WSSERVLET33.diag.check.1=Puede que se est\u00E9 utilizando un motor de transformaci\u00F3n que no es compatible. Aseg\u00FArese de que est\u00E1 utilizando el transformador y la versi\u00F3n correctos.
WSSERVLET33.diag.cause.2=Cuando se publica el WSDL de servicio, se aplica un parche a la ubicaci\u00F3n http con la ubicaci\u00F3n/punto final desplegados utilizando la transformaci\u00F3n XSLT. No se ha podido crear el transformador para realizar la transformaci\u00F3n.
WSSERVLET33.diag.check.2=Puede que haya un motor de transformaci\u00F3n que no est\u00E1 soportado o es incompatible. Compruebe el archivo server.xml para ver si hay excepciones.


exception.transformationFailed=WSSERVLET34: Fallo en la transformaci\u00F3n: {0}
WSSERVLET34.diag.cause.1=Ha fallado la aplicaci\u00F3n de parches de ubicaci\u00F3n en el WSDL al intentar realizar la transformaci\u00F3n.
WSSERVLET34.diag.check.1=Consulte el archivo log para obtener excepciones/errores m\u00E1s detallados.

exception.templateCreationFailed=WSSERVLET35: fallo al crear un objeto de plantilla
WSSERVLET35.diag.cause.1=Se ha creado una plantilla de hoja de estilo XSLT para la aplicaci\u00F3n de parches de ubicaci\u00F3n del WSDL utilizando la transformaci\u00F3n. Fallo de creaci\u00F3n de la plantilla.
WSSERVLET35.diag.check.1=Se ha devuelto una excepci\u00F3n durante la creaci\u00F3n de la plantilla. Consulte la excepci\u00F3n y el rastreo de pila para obtener m\u00E1s detalles.

servlet.html.method=WSSERVLET63: debe utilizar Post para este tipo de solicitud
WSSERVLET63.diag.cause.1=Las solicitudes de servicios web deben utilizar el m\u00E9todo HTTP POST: WSI BP 1.0
WSSERVLET63.diag.check.1=Aseg\u00FArese de que el cliente HTTP est\u00E1 utilizando solicitudes POST, no GET


servlet.faultstring.invalidContentType=WSSERVLET64: tipo de contenido no v\u00E1lido; se necesita text/xml
WSSERVLET64.diag.cause.1=Las solicitudes de servicios web deben tener el tipo de contenido text/xml: WSI BP 1.0
WSSERVLET64.diag.check.1=Aseg\u00FArese de que la solicitud del cliente est\u00E1 utilizando text/xml

error.implementorFactory.newInstanceFailed=WSSERVLET43: fallo al instanciar el implantador del servicio para el puerto \\"{0}\\"
WSSERVLET43.diag.cause.1=Fallo en la instanciaci\u00F3n del servicio web.
WSSERVLET43.diag.check.1=Aseg\u00FArese de que el servicio web est\u00E1 disponible y es p\u00FAblico. Examine la excepci\u00F3n para obtener m\u00E1s detalles.

error.implementorFactory.servantInitFailed=WSSERVLET44: fallo al inicializar el implantador del servicio para el puerto \"{0}\"
WSSERVLET44.diag.cause.1=El servicio web se ha instanciado, pero no se ha podido inicializar
WSSERVLET44.diag.check.1=Revise la excepci\u00F3n para obtener m\u00E1s detalles. Aseg\u00FArese de que todos los archivos de configuraci\u00F3n son correctos.

#not used by anything currently
servlet.faultstring.invalidSOAPAction=WSSERVLET65: cabecera no v\u00E1lida. Se necesita una acci\u00F3n de SOAP
WSSERVLET65.diag.cause.1=Se necesita una acci\u00F3n de SOAP
WSSERVLET65.diag.check.1=Agregue una acci\u00F3n de SOAP y el valor adecuado

# {0} - URI
servlet.no.address.available=No hay disponible ninguna direcci\u00F3n para {0}

servlet.html.title= Servicios Web
servlet.html.title2=<h1>Servicios web</h1>
servlet.html.noInfoAvailable=<p>No hay disponible ninguna informaci\u00F3n de contexto JAX-WS.</p>
servlet.html.columnHeader.portName=Punto Final
servlet.html.columnHeader.status=Estado
servlet.html.columnHeader.information=Informaci\u00F3n
# This is a status code and should not be translated (if you have to, translate it using capital letters).
servlet.html.status.active=ACTIVE
# This is a status code and should not be translated (if you have to, translate it using capital letters).
servlet.html.status.error=ERROR
servlet.html.endpoint.table=<table border=\\"0\\"><tr><td>Nombre de Servicio\\:</td><td>{0}</td></tr><tr><td>Nombre de Puerto\\:</td><td>{1}</td></tr></table>
servlet.html.information.table=<table border=\\"0\\"><tr><td>Direcci\u00F3n\\:</td><td>{0}</td></tr><tr><td>WSDL\\:</td><td><a href\\="{0}?wsdl">{0}?wsdl</a></td></tr><tr><td>Clase de Implantaci\u00F3n\\:</td><td>{1}</td></tr></table>
servlet.html.notFound=<h1>404 no se ha encontrado: {0}</h1>


#
#
# all the following properties are used by the http/ea package
# these properties are not longer used as http/ea is no longer used
#
error.implementorFactory.noConfiguration=WSSERVLET36: no se ha especificado ninguna configuraci\u00F3n
error.implementorFactory.noInputStream=WSSERVLET37: no se ha especificado ninguna configuraci\u00F3n
error.implementorRegistry.unknownName=WSSERVLET38: Nombre de puerto desconocido: {0}
error.implementorRegistry.cannotReadConfiguration=WSSERVLET39: no se puede leer la configuraci\u00F3n
error.implementorRegistry.classNotFound=WSSERVLET40: No se ha encontrado la clase: {0}
error.implementorRegistry.incompleteInformation=WSSERVLET41: la informaci\u00F3n de configuraci\u00F3n est\u00E1 incompleta
error.implementorRegistry.duplicateName=WSSERVLET42: Nombre de puerto duplicado: {0}

error.implementorRegistry.fileNotFound=WSSERVLET45: No se ha encontrado el archivo: {0}
error.wsdlPublisher.cannotReadConfiguration=WSSERVLET46: no se puede leer la configuraci\u00F3n
error.servlet.init.config.parameter.missing=WSSERVLET47: No se ha encontrado el par\u00E1metro de configuraci\u00F3n: \\"{0}\\"
error.servlet.init.config.fileNotFound=WSSERVLET48: no se ha encontrado el archivo de configuraci\u00F3n \"{0}\"
#

error.servlet.noImplementorForPort=WSSERVLET52: No se ha registrado ning\u00FAn implantador para el puerto: {0}
error.servlet.noPortSpecified=WSSERVLET53: no se ha especificado ning\u00FAn puerto en la URL de la solicitud POST de HTTP
error.servlet.noResponseWasProduced=WSSERVLET54: no se ha producido ninguna respuesta (error interno)
#
info.servlet.gotEmptyRequestMessage=WSSERVLET55: se ha obtenido un mensaje de solicitud vac\u00EDo
info.servlet.initializing=WSSERVLET56: Servlet JAX-WS: inicializar
info.servlet.destroying=WSSERVLET57: Servlet JAX-WS: destruir
#
trace.servlet.requestForPortNamed=WSSERVLET58: se ha obtenido una solicitud para el puerto {0}
trace.servlet.handingRequestOverToImplementor=WSSERVLET59: Entregando solicitud al implantador: {0}
trace.servlet.gotResponseFromImplementor=WSSERVLET60: Se ha obtenido respuesta del implantador: {0}
trace.servlet.writingFaultResponse=WSSERVLET61: escribiendo respuesta con fallos
trace.servlet.writingSuccessResponse=WSSERVLET62: escribiendo respuesta correcta
#
html.nonRootPage.title= Servicio Web
html.nonRootPage.body1= <p>Hay instalado un servicio web en esta URL.</p>
html.nonRootPage.body2= <p>URI de solicitud no v\u00E1lido.</p><p>Revise su informaci\u00F3n de despliegue.</p>
# Usage not found. TODO Remove
#html.nonRootPage.body3a= <p>Please refer to <a href=\'
# Concatenated with html.nonRootPage.body3a
#html.nonRootPage.body3b= \'>this page</a> for information about the deployed services.</p>
html.wsdlPage.title= Servicio Web
html.wsdlPage.noWsdl=<p>No hay disponible ning\u00FAn documento WSDL para la publicaci\u00F3n.</p><p>Revise la informaci\u00F3n de despliegue.</p>
html.rootPage.title= Servicio Web
html.rootPage.body1=<p>Hay instalado un servicio web en esta URL.</p>
html.rootPage.body2a=<p>Soporta los puertos siguientes:
html.rootPage.body2b=</p>
# Usage not found. TODO Remove
#html.rootPage.body3a=<p>A WSDL description of these ports is available <a href='
# Concatenated with html.rootPage.body3a
#html.rootPage.body3b='>here.</a></p>
html.rootPage.body4=<p>Este punto final est\u00E1 configurado de manera incorrecta. Compruebe la ubicaci\u00F3n y el contenido del archivo de configuraci\u00F3n.</p>
